src/InformationRegisters/ИсторияОбменаСТопЛогПоОбъектам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ИсторияОбменаСТопЛогПоОбъектам</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исходящее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕстьОшибки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИсторияОбменаСТопЛогПоОбъектам/Ext/ManagerModule.bsl
Процедура Добавить(Объект, НомерСообщения, ЕстьОшибки = Ложь, ОписаниеОшибки = "", Период = Неопределено, Исходящее = Истина) Экспорт
	
	МЗ = РегистрыСведений.ИсторияОбменаСТопЛогПоОбъектам.СоздатьМенеджерЗаписи();
	МЗ.Объект  			= Объект;
	МЗ.НомерСообщения 	= НомерСообщения;
	МЗ.ЕстьОшибки 		= ЕстьОшибки;
	МЗ.ОписаниеОшибки 	= ОписаниеОшибки;
	МЗ.Исходящее 		= Исходящее;
	МЗ.Период    		= ?(Не ЗначениеЗаполнено(Период), ТекущаяДата(), Период);
	
	Если Не ЗначениеЗаполнено(МЗ.Объект) Тогда
		Возврат;
	КонецЕсли;
	
	МЗ.Записать();	
	
КонецПроцедуры
